[
  {
    "file_id": 0,
    "title": "Game of Thrones",
    "content": "Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is A Game of Thrones. It is filmed in Belfast and elsewhere in the United Kingdom, Canada, Croatia, Iceland, Malta, Morocco, Spain, and the United States. The series premiered on HBO in the United States on April 17, 2011, and its seventh season ended on August 27, 2017. The series will conclude with its eighth season premiering in 2019. Set on the fictional continents of Westeros and Essos, Game of Thrones has several plot lines and a large ensemble cast but centers on three primary story arcs. The first story arc centers on the Iron Throne of the Seven Kingdoms and follows a web of alliances and conflicts among the dynastic noble families either vying to claim the throne or fighting for independence from the throne. The second story arc focuses on the last descendant of the realm's deposed ruling dynasty, exiled and plotting a return to the throne. The third story arc centers on the longstanding brotherhood charged with defending the realm against the ancient threats of the fierce peoples and legendary creatures that lie far north, and an impending winter that threatens the realm. Game of Thrones has attracted record viewership on HBO and has a broad, active, international fan base. It has been acclaimed by critics, particularly for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) has been criticized. The series has received 38 Primetime Emmy Awards, including Outstanding Drama Series in 2015 and 2016, more than any other primetime scripted television series. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation (2012–2014), a 2011 Peabody Award, and four nominations for the Golden Globe Award for Best Television Series – Drama (2012 and 2015–2017). Of the ensemble cast, Peter Dinklage has won two Primetime Emmy Awards for Outstanding Supporting Actor in a Drama Series (2011 and 2015) and the Golden Globe Award for Best Supporting Actor – Series, Miniseries or Television Film (2012) for his performance as Tyrion Lannister. Lena Headey, Emilia Clarke, Kit Harington, Maisie Williams, Diana Rigg, and Max von Sydow have also received Primetime Emmy Award nominations for their performances in the series."
  },
  {
    "file_id": 1,
    "title": "Vikings",
    "content": "Vikings is a historical drama television series written and created by Michael Hirst for the History channel. Filmed in Ireland, it premiered on March 3, 2013 in Canada. Vikings is inspired by the sagas of Danish/Swedish Viking Ragnar Lothbrok, one of the best-known legendary Norse heroes and notorious as the scourge of England and France. The show portrays Ragnar as a farmer who rises to fame by successful raids into England, and eventually becomes a Scandinavian king, with the support of his family and fellow warriors. After Ragnar's death the later seasons follow the fortunes of his sons, and their adventures in England, Scandinavia and the Mediterranean. On March 17, 2016, History renewed Vikings for a fifth season of 20 episodes, which premiered on November 29, 2017. On September 12, 2017, ahead of its fifth-season premiere, the series was renewed for a sixth season, which will consist of 20 episodes."
  },
  {
    "file_id": 2,
    "title": "Breaking Bad",
    "content": "Breaking Bad is an American neo-western crime drama television series created and produced by Vince Gilligan. The show originally aired on the AMC network for five seasons, from January 20, 2008 to September 29, 2013. It tells the story of Walter White (Bryan Cranston), a struggling high school chemistry teacher diagnosed with lung cancer. Together with his former student Jesse Pinkman (Aaron Paul), White turns to a life of crime by producing and selling crystallized methamphetamine to secure his family's financial future before he dies, while navigating the dangers of the criminal world. The title comes from the Southern colloquialism breaking bad, meaning to raise hell or turn toward crime. Breaking Bad is set and filmed in Albuquerque, New Mexico. Walter's family consists of his wife Skyler (Anna Gunn) and children, Walter, Jr. (RJ Mitte) and Holly (Elanor Anne Wenrich). The show also features Skyler's sister Marie Schrader (Betsy Brandt), and her husband Hank (Dean Norris), a Drug Enforcement Administration (DEA) agent. Walter hires lawyer Saul Goodman (Bob Odenkirk), who connects him with private investigator and fixer Mike Ehrmantraut (Jonathan Banks) and in turn Mike's employer, drug kingpin Gus Fring (Giancarlo Esposito). The final season introduces the characters Todd Alquist (Jesse Plemons) and Lydia Rodarte-Quayle (Laura Fraser). Breaking Bad is widely regarded as one of the greatest television series of all time. By the time the series finale aired, it was among the most-watched cable shows on American television. The show received numerous awards, including 16 Primetime Emmy Awards, eight Satellite Awards, two Golden Globe Awards, two Peabody Awards, two Critics' Choice Awards and four Television Critics Association Awards. For his leading performance, Cranston won the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series four times, while Aaron Paul won the Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series three times; Anna Gunn won the Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series twice. In 2013, Breaking Bad entered the Guinness World Records as the most critically acclaimed show of all time."
  },
  {
    "file_id": 3,
    "title": "Futurama",
    "content": "Futurama is an American animated science fiction comedy series created by Matt Groening for the Fox Broadcasting Company. The series follows the adventures of a late-20th-century New York City pizza delivery boy, Philip J. Fry, who finds employment at Planet Express, an interplanetary delivery company in the retro-futuristic 31st century after being unwittingly cryogenically frozen for one thousand years. The series was envisioned by Groening in the mid-1990s while working on The Simpsons; he later brought David X. Cohen aboard to develop storylines and characters to pitch the show to Fox. In the United States, the series aired on Fox from March 28, 1999, to August 10, 2003, before ceasing production. Futurama also aired in reruns on Cartoon Network's Adult Swim from 2003 to 2007, until the network's contract expired. It was revived in 2007 as four direct-to-video films; the last of which was released in early 2009. Comedy Central entered into an agreement with 20th Century Fox Television to syndicate the existing episodes and air the films as 16 new, half-hour episodes, constituting a fifth season. In June 2009, producing studio 20th Century Fox announced that Comedy Central had picked up the show for 26 new half-hour episodes, which began airing in 2010 and 2011. The show was renewed for a seventh season, with the first half airing in June 2012 and the second set for mid-2013. It was later revealed that the seventh season would be the final season, as Comedy Central announced that they would not be commissioning any further episodes. The series finale aired on September 4, 2013. While Groening has said he will try to get it picked up by another network, David X. Cohen stated that the episode Meanwhile would be the last episode of season 7 and also the series finale. A 42-minute audio-only episode featuring its original cast members was released on September 14, 2017, as an episode of The Nerdist Podcast entitled Futurama: Worlds of Tomorrow Presents, RADIORAMA!. Throughout its run, Futurama has received critical acclaim. The show has been nominated for 17 Annie Awards and 12 Emmy Awards, winning seven of the former and six of the latter. It has also been nominated four times for a Writers Guild of America Award, winning two for the episodes Godfellas and The Prisoner of Benda, been nominated for a Nebula Award and has received Environmental Media Awards for episodes The Problem with Popplers and The Futurama Holiday Spectacular. Futurama-related merchandise has also been released, including a tie-in comic book series, video games, calendars, clothes and figurines. In 2013, TV Guide ranked Futurama as one of the top 60 Greatest TV Cartoons of All Time."
  },
  {
    "file_id": 4,
    "title": "The Simpsons",
    "content": "The Simpsons is an American animated sitcom created by Matt Groening for the Fox Broadcasting Company. The series is a satirical depiction of working-class life, epitomized by the Simpson family, which consists of Homer, Marge, Bart, Lisa, and Maggie. The show is set in the fictional town of Springfield and parodies American culture and society, television, and the human condition. The family was conceived by Groening shortly before a solicitation for a series of animated shorts with producer James L. Brooks. Groening created a dysfunctional family and named the characters after members of his own family, substituting Bart for his own name. The shorts became a part of The Tracey Ullman Show on April 19, 1987. After a three-season run, the sketch was developed into a half-hour prime time show and became an early hit for Fox, becoming the network's first series to land in the Top 30 ratings in a season (1989–90). Since its debut on December 17, 1989, 629 episodes of The Simpsons have been broadcast. Its 29th season began on October 1, 2017. It is the longest-running American sitcom and the longest-running American animated program, and, in 2009, it surpassed Gunsmoke as the longest-running American scripted primetime television series. The Simpsons Movie, a feature-length film, was released in theaters worldwide on July 27, 2007, and grossed over $527 million. On November 4, 2016, the series was renewed for a twenty-ninth and thirtieth season of 22 episodes each, extending the show to 2019. The Simpsons received widespread critical acclaim throughout its first nine or ten seasons, which are generally considered its Golden Age. Time named it the 20th century's best television series, and Erik Adams of The A.V. Club named it television's crowning achievement regardless of format. On January 14, 2000, the Simpson family was awarded a star on the Hollywood Walk of Fame. It has won dozens of awards since it debuted as a series, including 31 Primetime Emmy Awards, 30 Annie Awards, and a Peabody Award. Homer's exclamatory catchphrase D'oh! has been adopted into the English language, while The Simpsons has influenced many other later adult-oriented animated sitcoms. Despite this, the show has also been criticized for what many perceive as a decline in quality over the years, generally since about the late 1990s."
  },
  {
    "file_id": 5,
    "title": "Supernatural",
    "content": "Supernatural is an American fantasy horror television series created by Eric Kripke. It was first broadcast on September 13, 2005, on The WB, and subsequently became part of successor The CW's lineup. Starring Jared Padalecki as Sam Winchester and Jensen Ackles as Dean Winchester, the series follows the two brothers as they hunt demons, ghosts, monsters, and other supernatural beings. The series is produced by Warner Bros. Television, in association with Wonderland Sound and Vision. Along with Kripke, executive producers have been McG, Robert Singer, Phil Sgriccia, Sera Gamble, Jeremy Carver, John Shiban, Ben Edlund and Adam Glass. Former executive producer and director Kim Manners died of lung cancer during production of the fourth season. The series is filmed in Vancouver, British Columbia and surrounding areas and was in development for nearly ten years, as creator Kripke spent several years unsuccessfully pitching it. The pilot was viewed by an estimated 5.69 million viewers, and the ratings of the first four episodes prompted The WB to pick up the series for a full season. Originally, Kripke planned the series for three seasons but later expanded it to five. The fifth season concluded the series' main storyline, and Kripke departed the series as showrunner. The series has continued on for several more seasons with new showrunners, including Sera Gamble, Jeremy Carver, Robert Singer and Andrew Dabb. With its eleventh season, Supernatural became the longest-running American live-action fantasy TV series. The series has been renewed for a thirteenth season, which premiered on October 12, 2017."
  },
  {
    "file_id": 6,
    "title": "Linkin Park",
    "content": "Linkin Park is an American rock band from Agoura Hills, California. Formed in 1996, the band rose to international fame with their debut album Hybrid Theory (2000), which was certified Diamond by the RIAA in 2005 and multi-Platinum in several other countries. Their following studio album Meteora continued the band's success, topping the Billboard 200 album chart in 2003, and was followed by extensive touring and charity work. Having adapted nu metal and rap metal to a radio-friendly yet densely layered style in Hybrid Theory and Meteora, the band explored other genres on their next studio album, Minutes to Midnight (2007). The album topped the Billboard charts and had the third-best debut week of any album that year. The band continued to explore a wider variation of musical types in their fourth album, A Thousand Suns (2010), layering their music with more electronic sounds. Their fifth album, Living Things (2012), combines musical elements from all of their previous records. Their sixth album, The Hunting Party (2014), returned to a heavier rock sound. Their seventh album One More Light, a more electronic and pop-oriented record, was released on May 19, 2017. In 2003, MTV2 named Linkin Park the sixth-greatest band of the music video era and the third-best of the new millennium. Billboard ranked Linkin Park No. 19 on the Best Artists of the Decade chart. In 2012, the band was voted as the greatest artist of the 2000s in a Bracket Madness poll on VH1. In 2014, the band was declared as the Biggest Rock Band in the World Right Now by Kerrang!. As the best-selling band of the 21st century and one of the world's best-selling music artists overall, Linkin Park has sold more than 70 million records worldwide and has won two Grammy Awards."
  },
  {
    "file_id": 7,
    "title": "Metallica",
    "content": "Metallica is an American heavy metal band from Los Angeles, California. The band was formed in 1981 by drummer Lars Ulrich and vocalist/guitarist James Hetfield. The band's fast tempos, instrumentals and aggressive musicianship made them one of the founding big four bands of thrash metal, alongside Megadeth, Anthrax and Slayer. Metallica's current lineup comprises founding members Hetfield and Ulrich, longtime lead guitarist Kirk Hammett and bassist Robert Trujillo. Guitarist Dave Mustaine (who formed Megadeth) and bassists Ron McGovney, Cliff Burton and Jason Newsted are former members of the band. Metallica earned a growing fan base in the underground music community and won critical acclaim with its first five albums. The band's third album, Master of Puppets (1986), was described as one of the heaviest and most influential thrash metal albums; its eponymous fifth album, Metallica (1991), the band's first to root predominantly in heavy metal, appealed to a more mainstream audience, achieving substantial commercial success and selling over 16 million copies in the United States to date, making it the best-selling album of the SoundScan era. After experimenting with different genres and directions in subsequent releases, the band returned to its thrash metal roots with the release of its ninth album, Death Magnetic (2008), which drew similar praise to that of the band's earlier albums. In 2000, Metallica led the case against the peer-to-peer file sharing service Napster, in which the band and several other artists filed lawsuits against the service for sharing their copyright-protected material without consent; after reaching a settlement, Napster became a pay-to-use service in 2003. Metallica was the subject of the acclaimed 2004 documentary film Some Kind of Monster, which documented the troubled production of the band's eighth album, St. Anger (2003), and the internal struggles within the band at the time. In 2009, Metallica was inducted into the Rock and Roll Hall of Fame. The band wrote the screenplay for and starred in the 2013 IMAX concert film Metallica: Through the Never, in which the band performed live against a fictional thriller storyline."
  },
  {
    "file_id": 8,
    "title": "The Witcher (video game)",
    "content": "The Witcher is an action role-playing game developed by CD Projekt Red and published by Atari, based on the novel series of The Witcher by Polish author Andrzej Sapkowski. The story takes place in a medieval fantasy world and follows Geralt of Rivia, one of a few traveling monster hunters who have supernatural powers, known as Witchers. The game's system of moral choices as part of the storyline was noted for its time-delayed consequences and lack of black-and-white morality. The game utilizes BioWare's proprietary Aurora Engine. A console version was to be released in late 2009 using an entirely new engine and combat system and entitled The Witcher: Rise of the White Wolf; it was suspended, however, due to payment problems with console developers Widescreen Games. Two sequels were released: The Witcher 2: Assassins of Kings in 2011 and The Witcher 3: Wild Hunt in 2015."
  },
  {
    "file_id": 9,
    "title": "Gothic",
    "content": "Gothic is a single-player action role-playing video game for Microsoft Windows developed by the German company Piranha Bytes. It was first released in Germany on March 15, 2001, followed by the English North American release eight months later on November 23, 2001, and the Polish release on March 28, 2002. Gothic has been well received by critics, scoring an average of 80% and 81/100 on Game Rankings' and Metacritic's aggregates, respectively. Reviewers credited the game for its story, complex interaction with other in-game characters, and graphics, but criticized it for the difficult control scheme and high system requirements."
  },
  {
    "file_id": 10,
    "title": "The Long Dark",
    "content": "The Long Dark is a first-person survival video game developed and published by Hinterland Studio. The player assumes the role of a crash-landed bush pilot who must survive the frigid Canadian wilderness after a global disaster. The game received seed financing from the Canada Media Fund, and further funding was secured through a successful Kickstarter campaign in October 2013. An alpha version was released through Steam Early Access in September 2014. The alpha version was later launched on the Xbox One as one of the first two launch titles associated with Microsoft's Game Preview Program in June 2015. Early reviews of the alpha release were generally positive, and the game went on to sell around 750,000 copies by April 2016. It was officially released on all aforementioned platforms on August 1, 2017, as well as for PlayStation 4."
  },
  {
    "file_id": 11,
    "title": "The Evil Within",
    "content": "The Evil Within is a third-person survival horror video game developed by Tango Gameworks and published by Bethesda Softworks. The game was directed by Resident Evil series creator, Shinji Mikami, and was released worldwide in October 2014 for PlayStation 3, PlayStation 4, Xbox 360, Xbox One and Microsoft Windows. The game centers on protagonist Sebastian Castellanos as he is pulled through a distorted world full of nightmarish locations and horrid creatures. Played in a third-person perspective, players battle disfigured nightmare-like enemies, including bosses, using guns and melee weapons, and progress through the levels, avoiding traps, using stealth, and finding collectables. The Evil Within received a generally positive reception upon release; praise was mostly directed at the game's horror elements and atmosphere, while criticism was directed at the game's story and characters. A sequel, The Evil Within 2, was released on October 13, 2017."
  },
  {
    "file_id": 12,
    "title": "Kaer Morhen",
    "content": "Kaer Morhen is an old keep where witchers used to be trained. The name is a corruption of the Caer a'Muirehen, which means 'Old Sea Keep' in Elder Speech due to the presence of fossilized sea creatures embedded in the stones on which it was built. It is located in the mountains of the kingdom of Kaedwen, right off the Gwenllech river. In older times, witchers trained and underwent mutations here, but fanatics who considered witchers an abomination attacked the keep and killed most of the teachers and students. Vesemir was the last known witcher to live in the keep, although other witchers sometimes rested here between their assignments, often during the winter, after which they set out on The Path again. The castle can only be reached by 'The Witchers Trail', which is easy to miss, and encircles the keep. It is often given a nickname 'The Killer' by young witchers."
  },
  {
    "file_id": 13,
    "title": "Skellige",
    "content": "Skellige, commonly referred to as the Skellige Isles or the Isles of Skellige, is an archipelago and one of the Northern Kingdoms. The group of six islands is situated in the Great Sea, off the coast of Cintra and southwest of Cidaris and Verden. It's legendary, famous for the unrivaled corsairs and swift longships that sail many seas. Its people are united under the King of the Skellige Isles, who's elected by the jarls of the seven major clans during traditional moots. In practice, however, the kings are from the same clan or at least related. Even though their relations with most of the North were always tense, to say the least, they were longtime allies of Cintra, due to the marriage between Queen Calanthe and Eist Tuirseach of Skellige. After King Eist's death in the Battle of Marnadal, the Islanders concentrated their raids on the Nilfgaardian Empire in an act of revenge."
  },
  {
    "file_id": 14,
    "title": "Novigrad",
    "content": "Novigrad is a free city within Redania and is therefore not subject to the rule of that kingdom. It is one of the major ports on the continent and populated by nearly 30,000 inhabitants, making it one of the largest cities in the North. Like any true metropolis, Novigrad has many factories and is home to all manner of craftsmen offering every ware possible and one can even find the occasional con-man or shady dealer. The city is also home to numerous banks and even has a zoo. The Eternal Fire is said to protect the city's inhabitants from all evil, monsters included. The thick city walls have never been breached, as they were tactfully designed by the architects of the Oxenfurt Academy. Novigrad is inhabited by an unusually colorful group of both permanent residents and those in town on long and short-term visits. Most eye-catching amidst the throngs of common townsfolk, stall-keepers, and craftsmen are those practicing the more roguish professions. There is no army in the city but it does have a Secret Service, an ever-present Temple Guard, and a powerful Temple Fleet."
  },
  {
    "file_id": 15,
    "title": "White Orchard",
    "content": "White Orchard is a region famous for its fruit orchards, whose boughs burst out white blossoms come spring. The Ismena river flows through the village and continues north. There is a Nilfgaardian Garrison headquartered in the northwest point of the region near the mouth of the river, led by Captain Peter Saar Gwynleve. In addition to the merchants listed below there are also six Places of Power. Two are for Quen and one for each of the other Signs."
  },
  {
    "file_id": 16,
    "title": "Velen",
    "content": "Velen, also called No Man's Land, is a province situated in northern Temeria, north of its capital Gors Velen. It is first mentioned in The Witcher 2: Assassins of Kings. It's said that once, a long time ago when Vrans ruled Loc Muinne, the slopes of Velen bloomed. In The Witcher 3: Wild Hunt, however, the former province has become a war-torn swampland under Nilfgaardian occupation with borders close to the cities of Novigrad and Oxenfurt. It's one of the major regions of the game, and its swamps with dense forests represent dark and mysterious elements of the plot. In the depopulated wastes of No Man's Land one often runs across armed men of all stripes - mercenaries, soldiers from the disbanded Temerian legions, marauders, and common bandits."
  },
  {
    "file_id": 17,
    "title": "Oxenfurt",
    "content": "Oxenfurt is a Redanian city located on the northern shore of the Pontar river and southeast of Novigrad. It is famous for its Academy, which is the largest in the Northern Kingdoms. It is about three hundred miles west of Tretogor. The bard, Dandelion, is said to simply adore the city. It is a bustling and bawdy haven for students, artists, scholars and freethinkers. Here the young reign supreme (in spirit, if not always in fact), with a mug of something strong in hand as they blaze new trails in fashion and thought, confident that the rest of the world will soon follow."
  },
  {
    "file_id": 18,
    "title": "Vizima",
    "content": "Vizima or Wyzim (Polish: Wyzima) is the capital city of Temeria, one of the Northern Kingdoms and the seat of king Foltest at the intersection of important trade routes. The city is not described in great detail in the Witcher saga. Most of the description comes from the short story The Witcher. In that tale, two taverns are mentioned: The Old Narakort and The Fox. There is also mention of the Roper's Gate, by which Geralt enters the town."
  },
  {
    "file_id": 19,
    "title": "JavaScript",
    "content": "JavaScript, often abbreviated as JS, is a high-level, interpreted programming language. It is a language which is also characterized as dynamic, weakly typed, prototype-based and multi-paradigm. Alongside HTML and CSS, JavaScript is one of the three core technologies of World Wide Web content engineering. It is used to make webpages interactive and provide online programs, including video games. The majority of websites employ it, and all modern web browsers support it without the need for plug-ins by means of a built-in JavaScript engine. Each of the many JavaScript engines represent a different implementation of JavaScript, all based on the ECMAScript specification, with some engines not supporting the spec fully, and with many engines supporting additional features beyond ECMA. As a multi-paradigm language, JavaScript supports event-driven, functional, and imperative (including object-oriented and prototype-based) programming styles. It has an API for working with text, arrays, dates, regular expressions, and basic manipulation of the DOM, but the language itself does not include any I/O, such as networking, storage, or graphics facilities, relying for these upon the host environment in which it is embedded. Initially only implemented client-side in web browsers, JavaScript engines are now embedded in many other types of host software, including server-side in web servers and databases, and in non-web programs such as word processors and PDF software, and in runtime environments that make JavaScript available for writing mobile and desktop applications, including desktop widgets. Although there are strong outward similarities between JavaScript and Java, including language name, syntax, and respective standard libraries, the two languages are distinct and differ greatly in design; JavaScript was influenced by programming languages such as Self and Scheme."
  },
  {
    "file_id": 20,
    "title": "Darkest Dungeon",
    "content": "Darkest Dungeon is a challenging gothic RPG about the stresses of dungeon crawling. You will lead a band of Heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on their mental fortitude! Five hundred feet below the earth you will not only fight unimaginable Foes, but famine, Disease, and the Stress of the ever-encroaching Dark. Darkest Dungeon focuses on the humanity and psychological vulnerability of the heroes and asks: What emotional toll does a life of adventure take? Darkest Dungeon is not a game where every hero wins the day with shiny armor and a smile. It is a game about hard trade-offs, nearly certain demise, and heroic acts. Tactical, strategic, and deceptively deep, the combat in Darkest Dungeon combines nostalgia with the elegance of modern design. It will challenge you in fresh new ways. Party order is crucial for setting up attacks, but it can also expose your Heroes to threats. At all times, you must juggle the need to do damage with the importance of protecting the health and minds of your party members. Train, upgrade, and adjust your loadout with Provisions and Trinkets to find the right combination of skills (together with Camping Skills), honing your party into a four-person monster-wrecking Special Forces team."
  },
  {
    "file_id": 21,
    "title": "Ciri",
    "content": "Cirilla Fiona Elen Riannon (also known as Ciri), was born in 1253 or 1252, and most likely during the Belleteyn holiday. She is the Princess of Cintra, the daughter of Pavetta and Emhyr var Emreis (who was using the alias 'Duny' at the time) as well as Queen Calanthe's granddaughter. After Geralt of Rivia helped lift Duny's curse, Duny asked what reward the witcher would like and Geralt proclaimed the Law of Surprise, as it turned out Pavetta was pregnant with Ciri, unbeknownst to Duny. Six years to the day after the child's birth, Geralt went back to Cintra for her, but did not take her with him to Kaer Morhen at that time. In fact, he didn't even lay eyes on her and only spoke with Calanthe, who divulged no information to him, not even the child's gender. While she was still an infant, Ciri's parents were both lost in a storm at sea and were presumed dead. She spent her youth in Cintra and Skellige under the care of her grandmother and her uncle."
  },
  {
    "file_id": 22,
    "title": "Geralt of Rivia",
    "content": "Geralt of Rivia is a witcher and the main protagonist of the Witcher series by Andrzej Sapkowski and its adaptations, including The Witcher (PC), The Witcher 2: Assassins of Kings, and The Witcher 3: Wild Hunt video games. Like all witchers, Geralt is a monster hunter for hire. He possesses superhuman abilities and is a master swordsman. During the Trial of the Grasses, Geralt exhibited unusual tolerance for the mutagens that grant witchers their abilities. Accordingly, Geralt was subjected to further experimental mutagens which rendered his hair white and may have given him greater speed, strength, and stamina than his fellow witchers. Geralt is also known as Gwynbleidd, meaning 'White Wolf' in Elder Speech. He was given this alias by the dryads, and is also called the Butcher of Blaviken after an unfortunate incident in that town. Despite his title, Geralt does not hail from the city of Rivia. After being left with the witchers by his mother, Visenna, he grew up in their keep of Kaer Morhen in the realm of Kaedwen. In the interest of appearing more trustworthy to potential clients, young witchers were encouraged to make up surnames for themselves by master Vesemir. As his first choice, Geralt chose 'Geralt Roger Eric du Haute-Bellegarde', but this choice was dismissed by Vesemir as silly and pretentious, so 'Geralt' was all that remained of his chosen name. 'Of Rivia' was a more practical alternative and Geralt even went so far as to adopt a Rivian accent to appear more authentic. Later, Queen Meve of Lyria knighted him for his valour in the Battle for the Bridge on the Yaruga conferring on him the formal title 'of Rivia', which amused him. He, therefore, became a true knight of Lyria, only to lose the title soon after for departing."
  },
  {
    "file_id": 23,
    "title": "Yennefer",
    "content": "Yennefer (born on Belleteyn of the year 1173) was a sorceress who lived in Vengerberg, the capital city of Aedirn. She was the youngest member of the Brotherhood of Sorcerers and later the Lodge of Sorceresses attempted to recruit her. She was Geralt of Rivia's true love and a mother figure to Ciri, a former royal advisor to king Demavend of Aedirn, and a close friend of Triss Merigold. The lady of Vengerberg was famous for her beauty, even though during the events of The Tower of the Swallow she was 94 years old. Yennefer had locks of curly, raven black hair fragrant with lilac and gooseberry perfume, falling in a cascade of curls on her shapely shoulders. Her face was very pale, triangular in shape with a slightly receded chin. Her eyes were cold and sparkling with a remarkable violet penetrating gaze, in anger blazing with livid, blue-gray fire. Those very eyes also concealed wisdom and imperiousness. Yennefer's nose was slightly long, mouth was pale with thin and slightly crooked, soft, sweet with lipstick, proud lips. On her long and slender neck hung a black marigold with a star made of obsidian sparkling with a multitude of tiny diamonds embedded in it. Yen had pronounced cheekbones, natural, slightly irregular eyebrows trimmed by hand and emphasized with charcoal, long eyelashes, and petite hands. Even in high-heeled shoes she wasn't tall, was beautiful but threatening, having incredibly thin and slender waist and slender legs. Yennefer's skin was as delicate as a sixteen-year-old girl. Her breasts were rounded and delicate, with nipples so pale that they were apparent only by their prominence. She always dressed in black and white, at times wore stockings, wore frilled panties but never wore trivialities with underwire, she didn't need to. Her voice was resonant and mildly derisive. Her overall feminine shape was one of a twenty-year-old girl and she moved with a natural, unforced grace. She was a quadroon (meaning she had ¼ of elven blood, in her case on her mother's side). During the Battle of Sodden Hill she was blinded by Fringilla Vigo, a Nilfgaardian sorceress. Her sight was later magically restored but she still bore the emotional scars. Like most sorceresses, she was sterile. She secretly sought a way of restoring her fertility. She gave her motherly love to Ciri - the child destined for Geralt by the Law of Surprise - teaching her about magic while in Ellander, at the Temple of Melitele under the watchful eye of Nenneke."
  },
  {
    "file_id": 24,
    "title": "Triss Merigold",
    "content": "Triss Merigold of Maribor was a legendary Temerian sorceress of the 13th century. Called Fourteenth of the Hill by her contemporaries because she was erroneously thought to have been killed during the Battle of Sodden Hill, she passed into history as Merigold the Fearless. A member of King Foltest's royal council along with Fercart and Keira Metz, as well as a founding member of the Lodge of Sorceresses, she was involved in politics for most of her life. She was friends with Yennefer and the witcher Geralt of Rivia, but also unhappily in love with the latter. Triss took care of Ciri at Kaer Morhen for some time and is like an older sister to her. It was through her intervention that Ciri was not subjected to harmful hormone changes at Kaer Morhen, stripping her of her secondary gender traits. She was a skilled healer and carried with her many magical potions, but she never uses them on herself because ironically, she was allergic to potions. She was also quite a powerful mage, certainly when it counted most. She wore an amulet - sapphire overlaid with silver."
  },
  {
    "file_id": 25,
    "title": "Gaunter ODimm",
    "content": "Gaunter O'Dimm, sometimes called Master Mirror or Man of Glass, is a minor character in The Witcher 3: Wild Hunt, and is the main antagonist of the Hearts of Stone expansion. He presents himself as a former merchant of mirrors, now a mangy vagrant. However, as one might suspect, he is a much more powerful individual, creating pacts with people in exchange for their souls and being able to control time with a mere clap of his hands."
  },
  {
    "file_id": 26,
    "title": "Keira Metz",
    "content": "Keira Metz of Carreras was a sorceress. She was a former advisor to King Foltest of Temeria, a role that had also been held by Triss Merigold and Fercart. She was fond of luxury, despised the dirtiness of the outdoors, and was rather eccentric in nature. She made aphrodisiacs, and was considered to be a nymphomaniac by Sabrina Glevissig. During the coup on Thanedd Island, she was thrown from a window by Artaud Terranova. She landed on Geralt of Rivia, who was passing below looking for his former ward, Ciri. Later, Keira became one of the youngest members of the newly formed Lodge of Sorceresses."
  },
  {
    "file_id": 27,
    "title": "Emhyr var Emreis",
    "content": "Emhyr var Emreis, Deithwen Addan yn Carn aep Morvudd (in the Elder Speech - the White Flame Dancing on the Barrows of his Enemies), also known to a few under his alias as Duny, the Urcheon of Erlenwald (Polish: Jeż z Erlenwaldu) was the Imperator of the Nilfgaardian Empire, Lord of Metinna, Ebbing, Gemmera, Sovereign of Nazair, Vicovaro and, after marrying Cirilla, King of Cintra, from 1257 when he overthrew the Usurper who murdered his father, Fergus var Emreis, until his death sometime in the late 13th century. His rule of Nilfgaard was highly aggressive, often pursuing expansionist policies similar to those of his predecessors. This led to the outbreak of two wars against the Northern Kingdoms, both of which he lost. Emhyr var Emreis was an intelligent and brilliant ruler. He chose his people well and crushed many plots against him. He was ruthless toward traitors and moved towards his goals with great determination. He was publicly favorable to the Elder Race, in stark contrast to monarchs of the North."
  },
  {
    "file_id": 28,
    "title": "Letho",
    "content": "Letho of Gulet, also known as the Kingslayer, is a witcher from the School of the Viper and the main antagonist in The Witcher 2: Assassins of Kings. His closest associates are Auckes and Serrit, also kingslayers and witchers from the School of the Viper. For reasons which were initially unknown, he enlisted the help of Iorveth and the Scoia'tael to aid him in his plan to kill the kings of the Northern Kingdoms. To back his claim, this man showed Iorveth a head he claims belonged to Demavend, King of Aedirn and Sovereign of the Pontar valley."
  },
  {
    "file_id": 29,
    "title": "Philippa Eilhart",
    "content": "Philippa Eilhart (Polish: Filippa Eilhart) was King Vizimir's advisor and remained in Redania's court even after his death, for which she was likely responsible. She was one of the few sorceresses able to polymorph. She led the Thanedd coup against the Brotherhood of Sorcerers, intending to neutralize suspected traitors allied with Nilfgaard. Later, she helped found the Lodge of Sorceresses and is considered its leader."
  },
  {
    "file_id": 30,
    "title": "Lambert",
    "content": "Lambert was one of the younger witchers from Kaer Morhen. Known for his biting tongue, he was often rude in conversation. He was particularly rude towards Triss Merigold, addressing her only by her last name, which irritated the sorceress greatly. He does not have much use for politics, a trait common to most witchers due to their code of neutrality. He helped train Ciri in the art of combat. He was described as being at the same age as Coën. He is one of the last witchers to be trained within the walls of Kaer Morhen."
  },
  {
    "file_id": 31,
    "title": "2018 Winter Olympics",
    "content": "The 2018 Winter Olympics, officially known as the XXIII Olympic Winter Games (Korean: 제23회 동계 올림픽, translit. Jeisipsamhoe Donggye Ollimpik) and commonly known as PyeongChang 2018, was a major international winter multi-sport event held between 9 and 25 February 2018 in Pyeongchang County, Gangwon Province, South Korea, with the opening rounds for certain events held on 8 February 2018, the eve of the opening ceremony. Pyeongchang was elected as the host city in July 2011, during the 123rd IOC Session in Durban, South Africa. This was the first time that South Korea had hosted the Winter Olympics and the second Olympics held in the country overall, after the 1988 Summer Olympics in Seoul. It was the third time that an East Asian country had hosted the Winter Games, after Sapporo (1972) and Nagano (1998), both in Japan. It was also the first of three consecutive Olympics to be held in East Asia, the other two being the 2020 Summer Olympics in Tokyo and the 2022 Winter Olympics in Beijing. The games featured 102 events in fifteen sports, with the addition of 'big air' snowboarding, mass start speed skating, mixed doubles curling, and mixed team alpine skiing to the Winter Olympic programme. 2,914 athletes from 92 NOCs competed, including the debuts of Ecuador, Eritrea, Kosovo, Malaysia, Nigeria and Singapore. After a state-sponsored doping program was exposed following the 2014 Winter Olympics, the Russian Olympic Committee was suspended, and selected athletes were allowed to compete neutrally under the IOC designation of 'Olympic Athletes from Russia'. Despite tense relations, North Korea agreed to participate in the Games, enter with South Korea during the opening ceremony as a unified Korea, and field a unified team in women's ice hockey."
  },
  {
    "file_id": 32,
    "title": "FC Viktoria Plzen",
    "content": "Football Club Viktoria Plzen is a Czech professional football club based in Pilsen. They currently play in the Czech First League, the top division of football in the country. As runners-up in the 1970–71 Czechoslovak Cup, the club gained the right to play in the following season's Cup Winners' Cup, as winners Spartak Trnava also won the championship and played in the European Cup. In 2010, they played in the UEFA Europa League after winning the 2009–10 Czech Cup. The club won the Czech league for the first time in 2011, and participated in the 2011–12 UEFA Champions League group stage, during which they won their first Champions League match, earning five points and qualifying for the Round of 32 in the 2011–12 UEFA Europa League. The club won their second Czech league title in the 2012–13 season. In 2013–14, the club participated in the UEFA Champions League group stage and finished third. They then reached the round of 16 in UEFA Europa League before being eliminated by Lyon."
  },
  {
    "file_id": 33,
    "title": "Czech Republic",
    "content": "The Czech Republic is a landlocked nation state in Central Europe bordered by Germany to the west, Austria to the south, Slovakia to the east and Poland to the northeast. The Czech Republic covers an area of 78,866 square kilometres (30,450 sq mi) with a mostly temperate continental climate and oceanic climate. It is a unitary parliamentary republic, has 10.6 million inhabitants and the capital and largest city is Prague, with 1.3 million residents. The Czech Republic is a member of the European Union (EU), NATO, the OECD, the United Nations, the OSCE, and the Council of Europe. It is a developed country with an advanced, high income export-oriented social market economy based on services, manufacturing and innovation. The UNDP ranks the country 14th in inequality-adjusted human development. The Czech Republic is a welfare state with a 'continental' European social model, a universal health care system and tuition-free university education. It ranks as the 6th safest or most peaceful country and is one of the most non-religious countries in the world, while achieving strong performance in democratic governance. The Czech Republic includes the historical territories of Bohemia, Moravia, and Czech Silesia. The Czech state was formed in the late 9th century as the Duchy of Bohemia under the Great Moravian Empire. After the fall of the Empire in 907, the centre of power transferred from Moravia to Bohemia under the Přemyslid dynasty. In 1002, the duchy was formally recognized as part of the Holy Roman Empire, becoming the Kingdom of Bohemia in 1198 and reaching its greatest territorial extent in the 14th century. Besides Bohemia itself, the king of Bohemia ruled the lands of the Bohemian Crown, he had a vote in the election of the Holy Roman Emperor, and Prague was the imperial seat in periods between the 14th and 17th century. In the Hussite wars of the 15th century driven by the Protestant Bohemian Reformation, the kingdom faced economic embargoes and defeated five consecutive crusades proclaimed by the leaders of the Roman Catholic Church."
  },
  {
    "file_id": 34,
    "title": "Slovakia",
    "content": "Slovakia is a landlocked country in Central Europe. It is bordered by the Poland to the north, Ukraine to the east, the Czech Republic to the west, Hungary to the south, and Austria to the southwest. Slovakia's territory spans about 49,000 square kilometres (19,000 sq mi) and is mostly mountainous. The population is over 5 million and comprises mostly of Slovaks. The capital and largest city is Bratislava. The official language is Slovak. The Slavs arrived in the territory of present-day Slovakia in the 5th and 6th centuries. In the 7th century, they played a significant role in the creation of Samo's Empire and in the 9th century established the Principality of Nitra. In the 10th century, the territory was integrated into the Kingdom of Hungary. After World War I and the dissolution of the Austro-Hungarian Empire, the Slovaks and Czechs established Czechoslovakia (1918–1939). A separate (First) Slovak Republic (1939–1945) existed in World War II as a client state of Nazi Germany. In 1945, Czechoslovakia was re-established and under Communist rule became a Soviet satellite. In 1989, the Velvet Revolution ended Communist rule in Czechoslovakia. Slovakia became an independent state on 1 January 1993 after the peaceful dissolution of Czechoslovakia, sometimes known as the Velvet Divorce."
  },
  {
    "file_id": 35,
    "title": "Poland",
    "content": "Poland is a unitary sovereign state in Central Europe. It is divided into 16 administrative subdivisions, covering an area of 312,679 square kilometres (120,726 sq mi) with a mostly temperate climate. With a population of over 38.5 million people, Poland is the sixth most populous member state of the European Union. Poland's capital and largest city is Warsaw. Other major cities include Kraków, Łódź, Wrocław, Poznań, Gdańsk and Szczecin. The establishment of a Polish state can be traced back to 966, when Mieszko I, ruler of a territory roughly coextensive with that of present-day Poland, converted to Christianity. The Kingdom of Poland was founded in 1025, and in 1569 it cemented a longstanding political association with the Grand Duchy of Lithuania by signing the Union of Lublin. This union formed the Polish–Lithuanian Commonwealth, one of the largest (about 1 million km2) and most populous countries of 16th and 17th century Europe, with a uniquely liberal political system which adopted Europe's first written national constitution, the Constitution of 3 May 1791. Following the Partitions of Poland at the end of the 18th century, Poland regained its independence in 1918 with the Treaty of Versailles. In September 1939, World War II started with the invasion of Poland by Nazi Germany, followed by the Soviet Union invading Poland in accordance with the Molotov–Ribbentrop Pact. More than six million Poles died in the war. After World War II, the Polish People's Republic was established as a satellite state under Soviet influence. In the aftermath of the Revolutions of 1989, most notably through the emergence of the Solidarity movement, Poland reestablished itself as a democratic republic."
  },
  {
    "file_id": 36,
    "title": "Germany",
    "content": "Germany, officially the Federal Republic of Germany (German: Bundesrepublik Deutschland, About this sound listen (help·info)), is a federal parliamentary republic in central-western Europe. It includes 16 constituent states, covers an area of 357,021 square kilometres (137,847 sq mi), and has a largely temperate seasonal climate. With about 82 million inhabitants, Germany is the most populous member state of the European Union. Germany's capital and largest metropolis is Berlin, while its largest conurbation is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Frankfurt, Stuttgart, Düsseldorf, Leipzig, Bremen, Dresden, Hannover, and Nuremberg. Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before 100 AD. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman Empire, the German Confederation was formed in 1815. The German revolutions of 1848–49 resulted in the Frankfurt Parliament establishing major democratic rights. In 1871, Germany became a nation state when most of the German states unified into the Prussian-dominated German Empire. After World War I and the revolution of 1918–19, the Empire was replaced by the parliamentary Weimar Republic. The Nazi seizure of power in 1933 led to the establishment of a dictatorship, World War II and the Holocaust. After the end of World War II in Europe and a period of Allied occupation, two German states were founded: West Germany, formed of the American, British and French occupation zones, and East Germany, formed of the Soviet occupation zone. Following the Revolutions of 1989 that ended communist rule in Central and Eastern Europe, the country was reunified on 3 October 1990."
  },
  {
    "file_id": 37,
    "title": "United States",
    "content": "The United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions. At 3.8 million square miles (9.8 million km2) and with over 325 million people, the United States is the world's third- or fourth-largest country by total area and the third-most populous country as well as the largest Christian-majority country. The capital is Washington, D.C., and the largest city by population is New York City. Forty-eight states and the capital's federal district are contiguous and located in North America between Canada and Mexico. The state of Alaska is in the northwest corner of North America, bordered by Canada to the east and across the Bering Strait from Russia to the west. The state of Hawaii is an archipelago in the mid-Pacific Ocean. The U.S. territories are scattered about the Pacific Ocean and the Caribbean Sea, stretching across nine official time zones. The extremely diverse geography, climate, and wildlife of the United States make it one of the world's 17 megadiverse countries. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Numerous disputes between Great Britain and the colonies following the French and Indian War led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, acquiring new territories, displacing Native American tribes, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. By the end of the century, the United States had extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. During the Cold War, the United States and the Soviet Union competed in the Space Race, culminating with the 1969 moon landing. The end of the Cold War and the collapse of the Soviet Union in 1991 left the United States as the world's sole superpower."
  },
  {
    "file_id": 38,
    "title": "Prague",
    "content": "Prague is the capital and largest city in the Czech Republic, the 14th largest city in the European Union and also the historical capital of Bohemia. Situated in the north-west of the country on the Vltava river, the city is home to about 1.3 million people, while its larger urban zone is estimated to have a population of 2.2 million. The city has a temperate climate, with warm summers and chilly winters. Prague has been a political, cultural and economic centre of central Europe complete with a rich history. Founded during the Romanesque and flourishing by the Gothic, Renaissance and Baroque eras, Prague was the capital of the kingdom of Bohemia and the main residence of several Holy Roman Emperors, most notably of Charles IV (r. 1346–1378). It was an important city to the Habsburg Monarchy and its Austro-Hungarian Empire. The city played major roles in the Bohemian and Protestant Reformation, the Thirty Years' War and in 20th-century history as the capital of Czechoslovakia, during both World Wars and the post-war Communist era. Prague is home to a number of famous cultural attractions, many of which survived the violence and destruction of 20th-century Europe. Main attractions include the Prague Castle, the Charles Bridge, Old Town Square with the Prague astronomical clock, the Jewish Quarter, Petřín hill and Vyšehrad. Since 1992, the extensive historic centre of Prague has been included in the UNESCO list of World Heritage Sites. The city has more than ten major museums, along with numerous theatres, galleries, cinemas and other historical exhibits. An extensive modern public transportation system connects the city. Also, it is home to a wide range of public and private schools, including Charles University in Prague, the oldest university in Central Europe."
  },
  {
    "file_id": 39,
    "title": "JSON",
    "content": "In computing, JavaScript Object Notation or JSON is an open-standard file format that uses human-readable text to transmit data objects consisting of attribute–value pairs and array data types (or any other serializable value). It is a very common data format used for asynchronous browser–server communication, including as a replacement for XML in some AJAX-style systems. JSON is a language-independent data format. It was derived from JavaScript, but as of 2017 many programming languages include code to generate and parse JSON-format data. The official Internet media type for JSON is application/json. JSON filenames use the extension .json. Douglas Crockford originally specified the JSON format in the early 2000s; two competing standards, RFC 8259 and ECMA-404, defined it in 2017. The ECMA standard describes only the allowed syntax, whereas the RFC covers some security and interoperability considerations."
  },
  {
    "file_id": 40,
    "title": "HTML",
    "content": "Hypertext Markup Language (HTML) is the standard markup language for creating web pages and web applications. With Cascading Style Sheets (CSS) and JavaScript, it forms a triad of cornerstone technologies for the World Wide Web. Web browsers receive HTML documents from a web server or from local storage and render them into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for the appearance of the document. HTML elements are the building blocks of HTML pages. With HTML constructs, images and other objects, such as interactive forms, may be embedded into the rendered page. It provides a means to create structured documents by denoting structural semantics for text such as headings, paragraphs, lists, links, quotes and other items. HTML elements are delineated by tags, written using angle brackets. Tags such as <img /> and <input /> introduce content into the page directly. Others such as <p>...</p> surround and provide information about document text and may include other tags as sub-elements. Browsers do not display the HTML tags, but use them to interpret the content of the page. HTML can embed programs written in a scripting language such as JavaScript which affect the behavior and content of web pages. Inclusion of CSS defines the look and layout of content. The World Wide Web Consortium (W3C), maintainer of both the HTML and the CSS standards, has encouraged the use of CSS over explicit presentational HTML since 1997."
  },
  {
    "file_id": 41,
    "title": "Cascading Style Sheets",
    "content": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language. Although most often used to set the visual style of web pages and user interfaces written in HTML and XHTML, the language can be applied to any XML document, including plain XML, SVG and XUL, and is applicable to rendering in speech, or on other media. Along with HTML and JavaScript, CSS is a cornerstone technology used by most websites to create visually engaging webpages, user interfaces for web applications, and user interfaces for many mobile applications. CSS is designed primarily to enable the separation of presentation and content, including aspects such as the layout, colors, and fonts. This separation can improve content accessibility, provide more flexibility and control in the specification of presentation characteristics, enable multiple HTML pages to share formatting by specifying the relevant CSS in a separate .css file, and reduce complexity and repetition in the structural content. Separation of formatting and content makes it possible to present the same markup page in different styles for different rendering methods, such as on-screen, in print, by voice (via speech-based browser or screen reader), and on Braille-based tactile devices. It can also display the web page differently depending on the screen size or viewing device. Readers can also specify a different style sheet, such as a CSS file stored on their own computer, to override the one the author specified."
  },
  {
    "file_id": 42,
    "title": "Ajax",
    "content": "Ajax (also AJAX; short for 'Asynchronous JavaScript + XML') is a set of Web development techniques using many Web technologies on the client side to create asynchronous Web applications. With Ajax, Web applications can send and retrieve data from a server asynchronously (in the background) without interfering with the display and behavior of the existing page. By decoupling the data interchange layer from the presentation layer, Ajax allows for Web pages, and by extension Web applications, to change content dynamically without the need to reload the entire page. In practice, modern implementations commonly utilize JSON instead of XML due to the advantages of JSON being native to JavaScript. Ajax is not a single technology, but rather a group of technologies. HTML and CSS can be used in combination to mark up and style information. The webpage can then be modified by JavaScript to dynamically display – and allow the user to interact with — the new information. The built-in XMLHttpRequest object within JavaScript is commonly used to execute Ajax on webpages allowing for websites to load content onto the screen without refreshing the page. Ajax is also not a new technology, or another different language, just existing technologies used in new ways."
  },
  {
    "file_id": 43,
    "title": "Node.js",
    "content": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code server-side. Historically, JavaScript was used primarily for client-side scripting, in which scripts written in JavaScript are embedded in a webpage's HTML and run client-side by a JavaScript engine in the user's web browser. Node.js lets developers use JavaScript for server-side scripting—running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js represents a JavaScript everywhere paradigm, unifying web application development around a single programming language, rather than different languages for server side and client side scripts."
  },
  {
    "file_id": 44,
    "title": "Angular",
    "content": "Angula is a TypeScript-based open-source front-end web application platform led by the Angular Team at Google and by a community of individuals and corporations. Angular is a complete rewrite from the same team that built AngularJS."
  },
  {
    "file_id": 45,
    "title": "Trivium",
    "content": "Trivium is an American heavy metal band from Orlando, Florida, formed in 1999. After getting signed to Roadrunner Records in 2004, the band has released eight studio albums and over twenty singles. Their latest album, The Sin and the Sentence, was released on October 20, 2017. The band has sold over one million albums worldwide."
  },
  {
    "file_id": 46,
    "title": "A Quiet Place",
    "content": "A Quiet Place is a 2018 American horror film directed by John Krasinski, who stars alongside Emily Blunt. The film is produced by Michael Bay's company, Platinum Dunes, which is also run by Andrew Form and Bradley Fuller. The screenplay was written by Krasinski, Bryan Woods, and Scott Beck, based on a story by Woods and Beck. Beck and Woods began working on the story in 2014, and Paramount Pictures bought their spec script in 2017. Krasinski then joined as a director and wrote a new draft of the script. Principal photography took place later in the year in upstate New York. In A Quiet Place, a family must live life in silence while hiding from creatures which hunt exclusively by sound."
  },
  {
    "file_id": 47,
    "title": "Blade Runner 2049",
    "content": "Blade Runner 2049 is a 2017 American neo-noir science fiction film directed by Denis Villeneuve and written by Hampton Fancher and Michael Green. A sequel to the 1982 film Blade Runner, the film stars Ryan Gosling and Harrison Ford, with Ana de Armas, Sylvia Hoeks, Robin Wright, Mackenzie Davis, Carla Juri, Lennie James, Dave Bautista, and Jared Leto in supporting roles. Ford and Edward James Olmos reprise their roles from the original film. Set thirty years after the first film, Gosling plays K, a blade runner who uncovers a secret that threatens to instigate a war between humans and replicants. Because the sequel adopts the timeline of the original Blade Runner, which is set in 2019, just two years after the date of release of the sequel, the sequel is also a work of alternate history fiction that adopts the technological advancements of the first movie occurring between 1982 and 2019, while also disregarding many of the actual developments of the era, such as the ubiquity of flat-panel displays, the dissolution of the Soviet Union and the collapse of Pan Am."
  },
  {
    "file_id": 48,
    "title": "King Arthur: Legend of the Sword",
    "content": "King Arthur: Legend of the Sword is a 2017 epic fantasy film written and directed by Guy Ritchie and co-written by Joby Harold and Lionel Wigram, inspired by Arthurian legends. The film stars Charlie Hunnam as the eponymous character, with Jude Law, Àstrid Bergès-Frisbey, Djimon Hounsou, Aidan Gillen and Eric Bana in supporting roles.[6] King Arthur premiered at the TCL Chinese Theater on May 8, 2017 and was theatrically released in 2D and RealD 3D on May 12, 2017 in the United States and May 19, 2017 in the United Kingdom. The film grossed $148 million worldwide against its $175 million production budget, with critics warning audiences to stay away. Originally, the film was meant to be the first in a six-film franchise, but the planned sequels were cancelled after it underperformed at the box office and lost Warner Bros. and Village Roadshow Pictures over $150 million."
  },
  {
    "file_id": 49,
    "title": "Westworld",
    "content": "Westworld is an American science fiction western television series created by Jonathan Nolan and Lisa Joy. Produced by HBO, it is based on the 1973 film of the same name (written and directed by Michael Crichton) and to a lesser extent its 1976 sequel, Futureworld. The story takes place in Westworld, a fictional, technologically advanced Wild-West-themed amusement park populated by android hosts. The park caters to high-paying guests who may indulge their wildest fantasies within the park without fear of retaliation from the hosts (who are prevented by their programming from harming humans). Nolan and Joy serve as executive producers, along with J. J. Abrams, Jerry Weintraub, and Bryan Burk. The first season premiered on October 2, 2016, and concluded on December 4, 2016; it comprised ten episodes. In November 2016, HBO renewed the series for a ten-episode second season, which premiered on April 22, 2018. The series' debut on HBO garnered the network's highest viewership ratings for a premiere since the first episode of True Detective in 2014. Moreover, Westworld ranks as the most-watched first season of any HBO original series. On May 1, 2018, the series was renewed for a third season. The series has received largely positive reviews from critics, with particular praise having been given for its visuals, story, and performances."
  }
]
